[
  {
    "title": "Réécriture manuelle",
    "redaction": "Nous pensons que la meilleur solution pour vos besoins est une réécriture manuelle de votre application/logiciel. Nous pensons qu'en passant par cette étape qui peut sembler fastidieuse, vous allez pouvoir améliorer la qualité de votre code et le rendre plus simple le mettant ainsi à jour et lui permettant d'éviter des bugs ou des problèmes de performance. Il pourra de ce fait être plus adapté aux nouvelles technologies le rendant plus compétitif et attractif. Enfin, il y a un avantage budgétaire de taille car entretenir un code existant ancien nécessite de nombreuses ressources, en termes de personnel ou d'infrastructure."
  },
  {
    "title": "Réinterface",
    "redaction": "Vous semblez préférer une solution rapide qui ne bouscule pas tout ce que vous avez mis en place, ainsi nous vous proposons de faire une réinterface. Avec cette solution, nous vous proposons de ne pas toucher aux technologies que vous avez implémentées mais nous vous proposons une approche plus moderne en termes d’interface. Outre l’aspect esthétique qu’une réinterface peut offrir, elle peut aussi améliorer l’expérience utilisateur, ce que vos collaborateurs ne regretteront pas, ainsi qu’améliorer les performances général du logiciel, offrant une meilleure réactivité et une expérience plus fluide. "
  },
  {
    "title": "Refactoriser",
    "redaction": "La solution Refactor est conçue pour aider les entreprises à moderniser leur architecture mainframe et à la déplacer vers le cloud en toute sécurité. Elle offre une méthode progressive pour migrer vos applications et vos données vers une infrastructure de cloud computing plus moderne et flexible. Refactor prend en charge la réécriture de vos applications et de votre code en utilisant les dernières technologies de développement pour le cloud. Elle propose également une approche hybride pour la migration de vos données, en les transférant de manière transparente vers des systèmes de stockage de données cloud tels que Amazon S3 ou Azure Blob Storage.\nAvec Refactor, vous pouvez bénéficier d'une transition en douceur vers le cloud computing. Elle vous permet de moderniser vos applications et votre code tout en conservant la fonctionnalité et la qualité de votre système existant. Vous pouvez également profiter des fonctionnalités avancées de sécurité et de gestion des ressources proposées par les fournisseurs de services de cloud computing. Cela vous permet de vous concentrer sur votre cœur de métier sans avoir à vous soucier de la gestion de l'infrastructure.\nEn utilisant Refactor, vous pouvez réduire les coûts liés à la maintenance de votre infrastructure mainframe tout en augmentant la flexibilité et l'évolutivité de votre architecture. En effet, la migration de votre infrastructure vers le cloud vous permet de bénéficier de la tarification basée sur l'utilisation, ce qui vous permet de payer uniquement pour les ressources dont vous avez besoin. Cela peut réduire les coûts de maintenance de votre infrastructure, en plus de vous offrir une plus grande flexibilité pour ajuster les ressources en fonction des fluctuations de la demande.\nEnfin, Refactor peut également améliorer la productivité de vos développeurs en leur permettant de travailler avec les technologies les plus récentes. Elle facilite la mise en œuvre de nouveaux outils et de nouvelles fonctionnalités pour vos applications, ce qui peut améliorer la qualité de votre code et votre capacité à innover plus rapidement.\nEn somme, la solution Refactor est une solution efficace pour moderniser votre architecture mainframe en la déplaçant vers le cloud, tout en réduisant les coûts et en augmentant la flexibilité et l'évolutivité de votre infrastructure."
  },
  {
    "title": "Replateform",
    "redaction": "La solution Replatform est une option pratique pour moderniser votre architecture mainframe et la déplacer vers le cloud. Elle vous permet de migrer vos applications existantes vers une infrastructure cloud sans avoir à réécrire votre code ou à modifier vos processus métier. Replatform prend en charge la migration de vos applications mainframe vers une plateforme cloud sans changer la structure et la logique de votre code source. De plus, elle vous permet de migrer vos données de manière transparente en les transférant vers des systèmes de stockage de données cloud tels que Amazon S3 ou Azure Blob Storage.\nGrâce à Replatform, vous pouvez bénéficier d'une transition rapide vers le cloud. Elle permet de minimiser les perturbations dans vos processus métier et d'éviter les risques de perte de données. Vous pouvez également profiter des avantages de la scalabilité et de la flexibilité proposée par le cloud computing. Avec Replatform, vous pouvez réduire les coûts liés à la maintenance de votre infrastructure mainframe tout en améliorant les performances de votre système.\nEn utilisant Replatform, vous pouvez bénéficier d'une architecture cloud avec un minimum de perturbation. Elle vous permet de migrer rapidement vers une infrastructure plus moderne et flexible, sans avoir à repenser l'ensemble de votre système. Cela peut réduire les coûts de migration et de formation tout en offrant des avantages de sécurité, de gestion des ressources et de disponibilité.\nEnfin, Replatform peut également améliorer la productivité de vos développeurs en leur permettant de travailler avec des technologies cloud modernes. Elle leur permet de bénéficier des dernières fonctionnalités et outils de développement tout en restant cohérents avec leur code source existant. Cela peut améliorer la qualité de votre code et faciliter la transition vers un environnement de développement plus agile.\nEn somme, la solution Replatform est une option pratique pour moderniser votre architecture mainframe en la déplaçant vers le cloud, tout en réduisant les coûts et en améliorant les performances et la flexibilité de votre infrastructure."
  },
  {
    "title": "Remplacer par un logiciel SaaS",
    "redaction": "Transformer votre logiciel en un Software As A Service vous permettra de vous débarrasser du besoin d'acheter, d'installer et de déployer physiquement votre application à travers votre organisation. Grâce aux services AWS, vous pouvez nous confier la sécurité, la maintenance et les mises à niveau des fonctionnalités de votre application, vous permettant de vous concentrer sur des tâches plus importantes. Grâce à un système d'abonnement, vos clients auront accès à votre logiciel, en utilisant simplement un navigateur internet.\nTransformer votre logiciel en un Software As A Service vous permettra de vous débarrasser du besoin d'acheter, d'installer et de déployer physiquement votre application à travers votre organisation. Grâce aux services AWS, vous pouvez nous confier la sécurité, la maintenance et les mises à niveau des fonctionnalités de votre application, vous permettant de vous concentrer sur des tâches plus importantes. Grâce à un système d'abonnement, vos clients auront accès à votre logiciel, en utilisant simplement un navigateur internet."
  },
  {
    "title": "Remplacer par un logiciel sur site",
    "redaction": "Contrairement à un SaaS, à travers cette méthode, votre logiciel sera hébergé en interne, au sein du serveur situé localement dans votre entreprise. Cela vous permettra d'avoir un contrôle total sur votre logiciel, le rendant plus sûr, mais en demandant plus d'investissement économique et temporel de la part de votre entreprise. Vous êtes également responsable de la sécurité et de la gestion du logiciel tout au long de son cycle de vie. Pour permettre l'accès au logiciel depuis l'extérieur, vos utilisateurs devront vous acheter une licence.\nContrairement à un SaaS, à travers cette méthode, votre logiciel sera hébergé en interne, au sein du serveur situé localement dans votre entreprise. Cela vous permettra d'avoir un contrôle total sur votre logiciel, le rendant plus sûr, mais en demandant plus d'investissement économique et temporel de la part de votre entreprise. Vous êtes également responsable de la sécurité et de la gestion du logiciel tout au long de son cycle de vie. Pour permettre l'accès au logiciel depuis l'extérieur, vos utilisateurs devront vous acheter une licence.\nIl existe aussi une alternative, où ce modèle existe en cohabitation avec le SaaS, qui permet généralement d'offrir les avantages de praticités du SaaS, tout en conservant la robustesse du modèle sur site. N'hésitez à contacter votre correspondant AWS pour évaluer les capacités de votre entreprise à soutenir ce modèle."
  },
  {
    "title": "Ne faites rien"
  },
  {
    "title": "Vous n'êtes pas éligible au questionnaire"
  }
]
